# Домашнее задание 2 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [2]:
import pandas as pd
import glob as gl

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [3]:
#your code here

info_Students = sorted(gl.glob('Data/Students_info_*.csv'))
info_Marks = sorted(gl.glob('Data/Students_marks_*.csv'))

Students = pd.concat((pd.read_csv(data).assign(filename=data)
                     for data in info_Students),
                     ignore_index=True)

Marks = pd.concat((pd.read_csv(data).assign(filename=data)
                     for data in info_Marks),
                     ignore_index=True)

df = pd.merge(Students, Marks, on='index')
df = df.drop(['filename_x', 'filename_y'], axis=1)
df

# Решил испольщовать библиотеку global чтобы изъять все документы из папки Data

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,4,male,group C,some college,standard,none,group1,76,78,75
...,...,...,...,...,...,...,...,...,...,...
995,995,female,group E,master's degree,standard,completed,group10,88,99,95
996,996,male,group C,high school,free/reduced,none,group10,62,55,55
997,997,female,group C,high school,free/reduced,completed,group10,59,71,65
998,998,female,group D,some college,standard,completed,group10,68,78,77
999,999,female,group D,some college,free/reduced,none,group10,77,86,86

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [4]:
#your code here

df = df.drop(["index"], axis=1)
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [5]:
# your code here

df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [6]:
# your code here

df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [7]:
# your code here


check = df.isna().sum()
check

# Так как везде 0, то пропущенных значений нет

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
group                          0
math score                     0
reading score                  0
writing score                  0
dtype: int64

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [8]:
# your code here

mean_math = df['math score'].mean()
mean_reading = df['reading score'].mean()
mean_writing = df['writing score'].mean()

result = pd.DataFrame({'math': mean_math,
                      'reading': mean_reading,
                      'writing': mean_writing}, index=['mean among students'])

result

                       math  reading  writing
mean among students  66.089   69.169   68.054

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [9]:
# Здесь я кодировал столбец с прохождением курса, где 1 - это курс стуентом был пройден, а 0 - не пройден
df['test preparation course'] = df['test preparation course'].apply(lambda x: 1 if x == "completed" else 0)

In [10]:
# your code here

done = df[['math score', 'reading score', 'writing score']].where(df['test preparation course'] == 1).mean()
skipped = df[['math score', 'reading score', 'writing score']].where(df['test preparation course'] == 0).mean()

result_for_7th_task = pd.DataFrame(data=[done, skipped], index=['test was done', 'test wasn\'t done'])
result_for_7th_task

                  math score  reading score  writing score
test was done      69.695531      73.893855      74.418994
test wasn't done   64.077882      66.534268      64.504673

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [11]:
# your code here
result_for_8th_task = df['lunch'].unique()
print(result_for_8th_task)

['standard' 'free/reduced']

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [12]:
# your code here

df = df.rename(columns={"parental level of education" : "education",
                  "test preparation course" : "test preparation"})
df

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,0,group1,72,72,74
1,female,group C,some college,standard,1,group1,69,90,88
2,female,group B,master's degree,standard,0,group1,90,95,93
3,male,group A,associate's degree,free/reduced,0,group1,47,57,44
4,male,group C,some college,standard,0,group1,76,78,75
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,1,group10,88,99,95
996,male,group C,high school,free/reduced,0,group10,62,55,55
997,female,group C,high school,free/reduced,1,group10,59,71,65
998,female,group D,some college,standard,1,group10,68,78,77
999,female,group D,some college,free/reduced,0,group10,77,86,86

**Зафиксируем минимальный балл для сдачи экзамена**

In [13]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [14]:
# your code here

total_number_of_students = df['math score'].count() 
overall_prop_of_success = (df['math score'] >= passmark).sum() / total_number_of_students
'{:.0%}'.format(overall_prop_of_success)

passed_prop_of_success = (df.where(df['test preparation'] == 1)['math score'] >= passmark).sum() / (df['test preparation'] == 1).sum()
'{:.0%}'.format(passed_prop_of_success)

failed_women = (df.where((df['gender'] == "female") & 
                         (df['test preparation'] == 0))["math score"] < passmark).sum() / ((df['test preparation'] == 0) & 
                                                                                           (df['gender'] == "female")).sum()

print("Доля студентов, которая сдала экзамен по математике ", overall_prop_of_success, 
      "\n",
      "Доля студентов, проходивших курс подготовки к экзамену, которая сдала экзамен по математике ", passed_prop_of_success, 
      "\n",
      "Доля женщин, не проходивших курс подготовки к экзамену, которая не сдала экзамен по математике ", failed_women, 
      sep="")

Доля студентов, которая сдала экзамен по математике 0.865
Доля студентов, проходивших курс подготовки к экзамену, которая сдала экзамен по математике 0.9217877094972067
Доля женщин, не проходивших курс подготовки к экзамену, которая не сдала экзамен по математике 0.20958083832335328

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [15]:
# your code here
%time
races_category = pd.DataFrame([df.groupby(df['race/ethnicity'])['reading score'].mean()])

education_category = pd.DataFrame([df.groupby(df['education'])['writing score'].min()])

print(races_category,"\n\n", education_category, sep='')

# Так как надо было засечь время (как я понял) работы кода сразу двух заданий, то решил поместить их в одну
# клетку, поэтому вывод такой некрасивый.

Wall time: 0 ns
race/ethnicity    group A    group B    group C    group D    group E
reading score   64.674157  67.352632  69.103448  70.030534  73.028571

education      associate's degree  bachelor's degree  high school  \
writing score                  35                 38           15

education      master's degree  some college  some high school
writing score               46            19                10

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [28]:
# your code here
%time

for i in df:
    if (i == 'race/ethnicity'):
        set_for_races = list(set(df[i]))
    elif (i == 'education'):
        set_for_education = list(set(df[i]))

new_for_races = list()
new_for_education = list()

for j in sorted(set_for_races):
    new_for_races.append(df.where(df['race/ethnicity'] == j)['reading score'].mean())

for h in sorted(set_for_education):
    new_for_education.append(df.where(df['education'] == h)['writing score'].min())
    

my_dict = {sorted(set_for_races)[i] : new_for_races[i] for i in range(len(set_for_races))}
my_dict |= {sorted(set_for_education)[i] : new_for_education[i] for i in range(len(set_for_education))}

my_dict

# Я решил использовать словарь чтобы хоть где-то хранить полученные данные, где у меня ключи 
# это принадлженость к рассе/степенью образования и значение это соответственно среднее и минимум.

Wall time: 0 ns

{'group A': 64.67415730337079,
 'group B': 67.35263157894737,
 'group C': 69.10344827586206,
 'group D': 70.03053435114504,
 'group E': 73.02857142857142,
 "associate's degree": 35.0,
 "bachelor's degree": 38.0,
 'high school': 15.0,
 "master's degree": 46.0,
 'some college': 19.0,
 'some high school': 10.0}

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [17]:
# your code here
result_for_13th_task = pd.pivot_table(df, index=['gender','education'], 
                                      values=['math score','reading score', 'writing score'])
result_for_13th_task

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [18]:
# your code here

df['Math_PassStatus'] = df['math score'].apply(lambda x : 'F' if x < passmark else 'P')
                                   
print('Students result of math exam:', df['Math_PassStatus'].value_counts(), sep='\n')

Students result of math exam:
P    865
F    135
Name: Math_PassStatus, dtype: int64

In [19]:
df['Writing_PassStatus'] = df['writing score'].apply(lambda x: 'F' if x < passmark else 'P')

print('Students result of writing exam:', df['Writing_PassStatus'].value_counts(), sep='\n')

Students result of writing exam:
P    886
F    114
Name: Writing_PassStatus, dtype: int64

In [20]:
df['Reading_PassStatus'] = df['reading score'].apply(lambda x: 'F' if x < passmark else 'P')

print('Students result of reading exam:', df['Reading_PassStatus'].value_counts(), sep='\n')

Students result of reading exam:
P    910
F     90
Name: Reading_PassStatus, dtype: int64

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [21]:
# your code here

df['OverAll_PassStatus'] = (df['Writing_PassStatus'] + 
                            df['Reading_PassStatus'] + 
                            df['Math_PassStatus']).apply(lambda x: 'P' if x == 'PPP' else 'F')

df['OverAll_PassStatus'].value_counts()

P    812
F    188
Name: OverAll_PassStatus, dtype: int64

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [27]:
def GetGrade(average_mark):
    # your code here
    
    if (average_mark >= 90):
        return 'A'
    elif (80 <= average_mark < 90):
        return 'B'
    elif (70 <= average_mark < 80):
        return 'C'
    elif (60 <= average_mark < 70):
        return 'D'
    elif (50 <= average_mark < 60):
        return 'E'
    elif (average_mark < 50):
        return 'F'

# your code here

df['Grade'] = ((df['math score'] + 
                df['writing score'] + 
                df['reading score']) / 3).apply(lambda x: GetGrade(x))

df['Grade'].value_counts()

C    261
D    256
E    182
B    146
F    103
A     52
Name: Grade, dtype: int64